In [1]:
import pandas as pd 
from utils import connection as con

In [2]:
conn_retail_db = con.connect_retail_db()
conn_dw_retail = con.connect_dw_retail()

In [3]:
from etl import extract as ex

In [4]:
df_customers = ex.extract_table("customers", conn_retail_db)
df_orders = ex.extract_table("orders", conn_retail_db)
df_order_items = ex.extract_table("order_items", conn_retail_db)
df_products = ex.extract_table("products", conn_retail_db)
df_categories = ex.extract_table("categories", conn_retail_db)
df_departments = ex.extract_table("departments", conn_retail_db)


df_customers.head()

,customer_id,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode
0,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,00725
3,4,Mary,Jones,XXXXXXXXX,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
4,5,Robert,Hudson,XXXXXXXXX,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,00725

In [5]:
from etl import load

In [6]:
load.load_dw_retail('dimension_customer',conn_dw_retail,df_customers.drop('customer_password', axis=1))

(MySQLdb.IntegrityError) (1062, "Duplicate entry '1' for key 'dimension_customer.PRIMARY'")
[SQL: INSERT INTO dimension_customer (customer_id, customer_fname, customer_lname, customer_email, customer_street, customer_city, customer_state, customer_zipcode) VALUES (%s, %s, %s, %s, %s, %s, %s, %s)]
[parameters: [(1, 'Richard', 'Hernandez', 'XXXXXXXXX', '6303 Heather Plaza', 'Brownsville', 'TX', '78521'), (2, 'Mary', 'Barrett', 'XXXXXXXXX', '9526 Noble Embers Ridge', 'Littleton', 'CO', '80126'), (3, 'Ann', 'Smith', 'XXXXXXXXX', '3422 Blue Pioneer Bend', 'Caguas', 'PR', '00725'), (4, 'Mary', 'Jones', 'XXXXXXXXX', '8324 Little Common', 'San Marcos', 'CA', '92069'), (5, 'Robert', 'Hudson', 'XXXXXXXXX', '10 Crystal River Mall ', 'Caguas', 'PR', '00725'), (6, 'Mary', 'Smith', 'XXXXXXXXX', '3151 Sleepy Quail Promenade', 'Passaic', 'NJ', '07055'), (7, 'Melissa', 'Wilcox', 'XXXXXXXXX', '9453 High Concession', 'Caguas', 'PR', '00725'), (8, 'Megan', 'Smith', 'XXXXXXXXX', '3047 Foggy Forest Plaza', 'Lawrence', 'MA', '01841')  ... displaying 10 of 12435 total bound parameter sets ...  (12434, 'Mary', 'Mills', 'XXXXXXXXX', '9720 Colonial Parade', 'Caguas', 'PR', '00725'), (12435, 'Laura', 'Horton', 'XXXXXXXXX', '5736 Honey Downs', 'Summerville', 'SC', '29483')]]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [7]:
load.load_dw_retail('dimension_department',conn_dw_retail,df_departments)

(MySQLdb.IntegrityError) (1062, "Duplicate entry '2' for key 'dimension_department.PRIMARY'")
[SQL: INSERT INTO dimension_department (department_id, department_name) VALUES (%s, %s)]
[parameters: [(2, 'Fitness'), (3, 'Footwear'), (4, 'Apparel'), (5, 'Golf'), (6, 'Outdoors'), (7, 'Fan Shop')]]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [8]:
load.load_dw_retail('dimension_category',conn_dw_retail,df_categories)

(MySQLdb.IntegrityError) (1452, 'Cannot add or update a child row: a foreign key constraint fails (`dw_retail`.`dimension_category`, CONSTRAINT `dimension_category_ibfk_1` FOREIGN KEY (`category_department_id`) REFERENCES `dimension_department` (`department_id`))')
[SQL: INSERT INTO dimension_category (category_id, category_department_id, category_name) VALUES (%s, %s, %s)]
[parameters: [(1, 2, 'Football'), (2, 2, 'Soccer'), (3, 2, 'Baseball & Softball'), (4, 2, 'Basketball'), (5, 2, 'Lacrosse'), (6, 2, 'Tennis & Racquet'), (7, 2, 'Hockey'), (8, 2, 'More Sports')  ... displaying 10 of 58 total bound parameter sets ...  (57, 8, 'MLB Players'), (58, 8, 'NFL Players')]]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [14]:
load.load_dw_retail('dimension_product',conn_dw_retail,df_products)

(MySQLdb.IntegrityError) (1452, 'Cannot add or update a child row: a foreign key constraint fails (`dw_retail`.`dimension_product`, CONSTRAINT `dimension_product_ibfk_1` FOREIGN KEY (`product_category_id`) REFERENCES `dimension_category` (`category_id`))')
[SQL: INSERT INTO dimension_product (product_id, product_category_id, product_name, product_description, product_price, product_image) VALUES (%s, %s, %s, %s, %s, %s)]
[parameters: [(1, 2, 'Quest Q64 10 FT. x 10 FT. Slant Leg Instant U', '', 59.98, 'http://images.acmesports.sports/Quest+Q64+10+FT.+x+10+FT.+Slant+Leg+Instant+Up+Canopy'), (2, 2, "Under Armour Men's Highlight MC Football Clea", '', 129.99, 'http://images.acmesports.sports/Under+Armour+Men%27s+Highlight+MC+Football+Cleat'), (3, 2, "Under Armour Men's Renegade D Mid Football Cl", '', 89.99, 'http://images.acmesports.sports/Under+Armour+Men%27s+Renegade+D+Mid+Football+Cleat'), (4, 2, "Under Armour Men's Renegade D Mid Football Cl", '', 89.99, 'http://images.acmesports.sports/Under+Armour+Men%27s+Renegade+D+Mid+Football+Cleat'), (5, 2, 'Riddell Youth Revolution Speed Custom Footbal', '', 199.99, 'http://images.acmesports.sports/Riddell+Youth+Revolution+Speed+Custom+Football+Helmet'), (6, 2, "Jordan Men's VI Retro TD Football Cleat", '', 134.99, 'http://images.acmesports.sports/Jordan+Men%27s+VI+Retro+TD+Football+Cleat'), (7, 2, 'Schutt Youth Recruit Hybrid Custom Football H', '', 99.99, 'http://images.acmesports.sports/Schutt+Youth+Recruit+Hybrid+Custom+Football+Helmet+2014'), (8, 2, "Nike Men's Vapor Carbon Elite TD Football Cle", '', 129.99, 'http://images.acmesports.sports/Nike+Men%27s+Vapor+Carbon+Elite+TD+Football+Cleat')  ... displaying 10 of 1345 total bound parameter sets ...  (1344, 59, "Nike Men's Home Game Jersey St. Louis Rams Aa", '', 100.0, 'http://images.acmesports.sports/Nike+Men%27s+Home+Game+Jersey+St.+Louis+Rams+Aaron+Donald+%2399'), (1345, 59, "Nike Men's Home Game Jersey St. Louis Rams Gr", '', 100.0, 'http://images.acmesports.sports/Nike+Men%27s+Home+Game+Jersey+St.+Louis+Rams+Greg+Robinson...')]]
(Background on this error at: https://sqlalche.me/e/20/gkpj)